In [2]:
import pandas as pd

In [17]:
data = {
   'order_id': [101, 102, 103, 104, 105, 106, 107],
   'customer_id': [1, 2, 1, 3, 2, 3, 1],
   'product': ['Laptop', 'Mouse', 'Monitor', 'Keyboard', 'Monitor', 'Mouse', 'Laptop'],
   'category': ['Electronics', 'Accessories', 'Electronics', 'Accessories', 'Electronics', 'Accessories', 'Electronics'],
   'price': [1200, 25, 300, 45, 280, 25, 1150],
   'quantity': [1, 2, 1, 3, 1, 20, 1],
   'order_date': pd.to_datetime([
       '2024-01-05', '2024-01-07', '2024-01-10',
       '2024-01-12', '2024-01-14', '2024-01-15', '2024-01-18'
   ])
}

# df = pd.read_csv(data.csv)
df = pd.DataFrame(data)
df

   order_id  customer_id   product     category  price  quantity order_date
0       101            1    Laptop  Electronics   1200         1 2024-01-05
1       102            2     Mouse  Accessories     25         2 2024-01-07
2       103            1   Monitor  Electronics    300         1 2024-01-10
3       104            3  Keyboard  Accessories     45         3 2024-01-12
4       105            2   Monitor  Electronics    280         1 2024-01-14
5       106            3     Mouse  Accessories     25        20 2024-01-15
6       107            1    Laptop  Electronics   1150         1 2024-01-18

In [18]:
df['total_rev'] = df['price'] * df['quantity']
df

,order_id,customer_id,product,category,price,quantity,order_date,total_rev
0,101,1,Laptop,Electronics,1200,1,2024-01-05,1200
1,102,2,Mouse,Accessories,25,2,2024-01-07,50
2,103,1,Monitor,Electronics,300,1,2024-01-10,300
3,104,3,Keyboard,Accessories,45,3,2024-01-12,135
4,105,2,Monitor,Electronics,280,1,2024-01-14,280
5,106,3,Mouse,Accessories,25,20,2024-01-15,500
6,107,1,Laptop,Electronics,1150,1,2024-01-18,1150

In [19]:
res = df.groupby('customer_id')['total_rev'].sum().rename('revenue').reset_index()
res

   customer_id  revenue
0            1     2650
1            2      330
2            3      635

In [26]:
res_sorted = res.sort_values(by='revenue', ascending = False)
res_sorted

   customer_id  revenue
0            1     2650
2            3      635
1            2      330

In [30]:
import pandas as pd
df = pd.DataFrame(data)

df['revenue'] = df['price'] * df ['quantity']

res = df.groupby('customer_id')['revenue'].sum().rename('total_revenue').reset_index()
res_sorted = res.sort_values(by = 'total_revenue', ascending = False)
res_sorted

   customer_id  total_revenue
0            1           2650
2            3            635
1            2            330